Белгипрозем_2017/src/Documents/мРеализация/мРеализация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мРеализация</name>
  <registerRecords>AccumulationRegister.УчетПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.УчетДоговоров</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПокупателями</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Корреспондент</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодБланка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапДоговора</name>
    <type>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.мСостоянияАктовВыполненныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияТТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>НоменклатураПроизводства</name>
      <type>
        <types>CatalogRef.мНоменклатураПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>Калькуляция</name>
      <type>
        <types>DocumentRef.мКалькуляция</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.мСтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсвобождениеОтНДС</name>
      <type>
        <types>CatalogRef.мОсвобождениеОтНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Белгипрозем_2017/src/Enums/мСостоянияАктовВыполненныхРабот/мСостоянияАктовВыполненныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>мСостоянияАктовВыполненныхРабот</name>
  <enumValues>
    <name>Черновик</name>
    <comment>При создании акта</comment>
  </enumValues>
  <enumValues>
    <name>Подготовлен</name>
    <comment>Акт распечатан и готов к отправке</comment>
  </enumValues>
  <enumValues>
    <name>НаправленЗаказчику</name>
    <comment>Подготовлено исходящее письмо</comment>
  </enumValues>
  <enumValues>
    <name>ВрученЗаказчику</name>
    <comment>Получено уведомление о доставке заказчику</comment>
  </enumValues>
  <enumValues>
    <name>ПодписанЗаказчикомКопия</name>
    <comment>Есть факсовая копия подписанного акта</comment>
  </enumValues>
  <enumValues>
    <name>ПодписанЗаказчиком</name>
    <comment>Подписанный акт возвращен заказчиком</comment>
  </enumValues>
  <enumValues>
    <name>ПодписанЗаказчикомСЗамечаниями</name>
    <comment>Акт возвращен с замечаниями заказчика</comment>
  </enumValues>
  <enumValues>
    <name>НеПодписан</name>
    <comment>Не подписан заказчиком</comment>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Documents/мРеализация/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Состояние = Перечисления.мСостоянияАктовВыполненныхРабот.Подготовлен;
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаСервере
Процедура ЭтапДоговораПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мЭтапыДоговоровНоменклатура.Ссылка,
		|	мЭтапыДоговоровНоменклатура.НоменклатураПроизводства,
		|	мЭтапыДоговоровНоменклатура.Калькуляция,
		|	мЭтапыДоговоровНоменклатура.Цена,
		|	мЭтапыДоговоровНоменклатура.Количество,
		|	мЭтапыДоговоровНоменклатура.Сумма,
		|	мЭтапыДоговоровНоменклатура.СтавкаНДС,
		|	мЭтапыДоговоровНоменклатура.ОсвобождениеОтНДС,
		|	мЭтапыДоговоровНоменклатура.НДС,
		|	мЭтапыДоговоровНоменклатура.Всего,
		|	мЭтапыДоговоровНоменклатура.КоличествоКвартал
		|ИЗ
		|	Справочник.мЭтапыДоговоров.Номенклатура КАК мЭтапыДоговоровНоменклатура
		|ГДЕ
		|	мЭтапыДоговоровНоменклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ЭтапДоговора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Объект.Номенклатура.Очистить();
	
	Пока Выборка.Следующий() Цикл
		Стр = Объект.Номенклатура.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, Выборка);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЭтапДоговораПриИзменении(Элемент)
	Если Объект.Номенклатура.Количество() > 0 Тогда
		Параметр = "";
		Оп = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияВопроса", ЭтотОбъект, Параметр);

		ПоказатьВопрос(Оп, "Табличная часть будет заполнена номенклатурой из этапа. Продолжать?",
			РежимДиалогаВопрос.ДаНет);
	Иначе
		ЭтапДоговораПриИзмененииНаСервере();		
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияВопроса(Результат, Параметр) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	ЭтапДоговораПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы

&НаКлиенте
Процедура НоменклатураНоменклатураПроизводстваПриИзменении(Элемент)
	ТекДанные = Элементы.Номенклатура.ТекущиеДанные;
	ТекДанные.Цена = ПолучитьЦенуКалькуляции(ТекДанные.Калькуляция);
	ТекДанные.Количество = ?(ТекДанные.Количество=0, 1, ТекДанные.Количество);
	ПересчитатьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураКалькуляцияПриИзменении(Элемент)
	ТекДанные = Элементы.Номенклатура.ТекущиеДанные;
	ТекДанные.Цена = ПолучитьЦенуКалькуляции(ТекДанные.Калькуляция);
	ТекДанные.Количество = ?(ТекДанные.Количество=0, 1, ТекДанные.Количество);
	ПересчитатьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураЦенаПриИзменении(Элемент)
	ПересчитатьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураКоличествоПриИзменении(Элемент)
	ПересчитатьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураСтавкаНДСПриИзменении(Элемент)
	РассчитатьНДС();
	РассчитатьВсего();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураСуммаПриИзменении(Элемент)
	РассчитатьНДС();
	РассчитатьВсего();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураНДСПриИзменении(Элемент)
	РассчитатьВсего();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьЦенуКалькуляции(Калькуляция)
	Если ЗначениеЗаполнено(Калькуляция) Тогда
		Возврат Калькуляция.Цена;
	КонецЕсли; 
	Возврат 0;	
КонецФункции 

&НаКлиенте
Процедура ПересчитатьСтроку()
	РассчитатьСумму();
	РассчитатьНДС();
	РассчитатьВсего();
КонецПроцедуры 

&НаКлиенте
Процедура РассчитатьСумму()
	ТекДанные = Элементы.Номенклатура.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	ТекДанные.Сумма = ТекДанные.Цена * ТекДанные.Количество;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьНДС()
	ТекДанные = Элементы.Номенклатура.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТекДанные.СтавкаНДС) Тогда
		РеквНДС = ПолучитьРеквизитыСтавкиНДС(ТекДанные.СтавкаНДС);
		
		Если РеквНДС.ЗначениеСтавкиНДС <> Неопределено Тогда
			ТекДанные.НДС = Окр(ТекДанные.Сумма * РеквНДС.ЗначениеСтавкиНДС / 100, 2); 
		Иначе
			ТекДанные.НДС = 0; 
		КонецЕсли; 
		Если РеквНДС.БезНДС <> Неопределено И РеквНДС.БезНДС Тогда
			ТекДанные.ОсвобождениеОтНДС = "";
		КонецЕсли; 
	Иначе
		ТекДанные.НДС = 0; 
		ТекДанные.ОсвобождениеОтНДС = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьВсего()
	ТекДанные = Элементы.Номенклатура.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	ТекДанные.Всего = ТекДанные.Сумма + ТекДанные.НДС;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизитыСтавкиНДС(СтавкаНДС)
	РеквНДС = Новый Структура("ЗначениеСтавкиНДС, БезНДС", Неопределено, Неопределено); 
	Если ЗначениеЗаполнено(СтавкаНДС) Тогда
		РеквНДС.Вставить("ЗначениеСтавкиНДС", СтавкаНДС.Ставка);
		РеквНДС.Вставить("БезНДС", СтавкаНДС.НеОблагается);
	КонецЕсли;
	Возврат РеквНДС;
КонецФункции  




#КонецОбласти
